ykominami/mruby-TECS_on_TOPPERS_BASE_PLATFORM/asp/pdic/stm32f7xx/device.h
/*
 *  RTCアラーム定義
 */
#define RTC_ALARM_A     RTC_CR_ALRAE
#define RTC_ALARM_B     RTC_CR_ALRBE

/*
 *  RTC日付、ウィークディ定義
 */ 
#define ALARMDAYSEL_DATE    0x00000000
#define ALARMDAYSEL_WEEKDAY 0x40000000

/*
 *  RTCマスク定義
 */ 
#define ALARMMASK_NONE      0x00000000
#define ALARMMASK_DATESEL   RTC_ALRMAR_MSK4
#define ALARMMASK_HOURS     RTC_ALRMAR_MSK3
#define ALARMMASK_MINUTES   RTC_ALRMAR_MSK2
#define ALARMMASK_SECONDS   RTC_ALRMAR_MSK1
#define ALARMMASK_ALL       (RTC_ALRMAR_MSK1 | RTC_ALRMAR_MSK2 | RTC_ALRMAR_MSK3 | RTC_ALRMAR_MSK4)

/*
 *  RTCサブセカンドアラームマッチ定義
 */
#define ALARMSSMASK_ALL     0x00000000	/* All Alarm SS fields are masked. */
#define ALARMSSMASK_SS14_1  0x01000000	/* SS[0]がマッチでアラーム */
#define ALARMSSMASK_SS14_2  0x02000000	/* SS[1:0]がマッチでアラーム */
#define ALARMSSMASK_SS14_3  0x03000000	/* SS[2-0]がマッチでアラーム */
#define ALARMSSMASK_SS14_4  0x04000000	/* SS[3-0]がマッチでアラーム */
#define ALARMSSMASK_SS14_5  0x05000000	/* SS[4-0]がマッチでアラーム */
#define ALARMSSMASK_SS14_6  0x06000000	/* SS[5-0]がマッチでアラーム */
#define ALARMSSMASK_SS14_7  0x07000000	/* SS[6-0]がマッチでアラーム */
#define ALARMSSMASK_SS14_8  0x08000000	/* SS[7-0]がマッチでアラーム */
#define ALARMSSMASK_SS14_9  0x09000000	/* SS[8-0]がマッチでアラーム */
#define ALARMSSMASK_SS14_10 0x0A000000	/* SS[9-0]がマッチでアラーム */
#define ALARMSSMASK_SS14_11 0x0B000000	/* SS[10-0]がマッチでアラーム */
#define ALARMSSMASK_SS14_12 0x0C000000	/* SS[11-0]がマッチでアラーム */
#define ALARMSSMASK_SS14_13 0x0D000000	/* SS[12-0]がマッチでアラーム */
#define ALARMSSMASK_SS14    0x0E000000	/* SS[13-0]がマッチでアラーム */
#define ALARMSSMASK_NONE    0x0F000000	/* SS[14-0]がマッチでアラーム */

#define RTC_ERROR_LSI   0x00000001
#define RTC_ERROR_LSE   0x00000002
#define RTC_ERROR_RTC   0x00000004

#define INHNO_ALARM     IRQ_VECTOR_RTC_ALARM
#define INTNO_ALARM     IRQ_VECTOR_RTC_ALARM

#define INTPRI_ALARM     -11       /* 割込み優先度 */
#define INTATR_ALARM     0         /* 割込み属性 */

#define INHNO_RTCWUP    IRQ_VECTOR_RTC_WKUP	/* 割込みハンドラ番号 */
#define INTNO_RTCWUP    IRQ_VECTOR_RTC_WKUP	/* 割込み番号 */
#define INTPRI_RTCWUP   -8          /* 割込み優先度 */
#define INTATR_RTCWUP   TA_EDGE     /* 割込み属性 */

/*
 *  日時設定用の構造体を定義
 */
struct tm2 {
  int	tm_sec;			/* 秒 */
  int	tm_min;			/* 分 */
  int	tm_hour;		/* 時 */
  int	tm_mday;		/* 月中の日 */
  int	tm_mon;			/* 月 */
  int	tm_year;		/* 年 */
  int	tm_wday;		/* 曜日 */
  int	tm_yday;		/* 年中の日 */
  int	tm_isdst;
};

/*
 *  RTCアラーム構造体
 */
typedef struct
{
	uint32_t            alarm;				/* アラーム選択 */
	uint32_t            alarmmask;			/* アラームマスク設定 */
	uint32_t            subsecondmask;		/* アラームサブセカンドマスク */
	uint32_t            dayselect;			/* アラーム日付設定 */
	uint32_t            subsecond;			/* アラームサブセカンド */
	void                (*callback)(void);	/* アラームコールバック */
}RTC_Alarm_t;

/*
 *  RTC-WAKEUP構造体
 */
typedef struct
{
	uint8_t	            wakeuptimerPrescaler;	/* WAKEUP TIMERプリスケーラ */
	uint8_t             asynchPrescaler;	/* 非同期プリスケーラ */
	uint16_t            synchPrescaler;		/* 非同期プリスケーラ */
}RTC_Wakeup_t;


extern uint32_t rtcerrorcode;

extern void rtc_init(intptr_t exinf);
extern ER rtc_set_time(struct tm2 *pt);
extern ER rtc_get_time(struct tm2 *pt);
extern ER rtc_setalarm(RTC_Alarm_t *parm, struct tm2 *ptm);
extern ER rtc_stopalarm(uint32_t Alarm);
extern ER rtc_getalarm(RTC_Alarm_t *parm, struct tm2 *ptm, uint32_t Alarm);
extern ER rtc_wakeup_init(RTC_Wakeup_t *parm, void (*func)(void));
extern ER rtc_setup_wakeuptime(uint32_t time);
extern uint32_t rtc_get_ssr(void);
extern void rtc_handler(void);
extern void wakeup_handler(void);
extern void rtc_info_init(intptr_t exinf);


/*
 *  ポートのLED接続ビット
 */
#define LED01           (1<<0)
#define LED02           (1<<1)
#define LED03           (1<<2)
#define LED04           (1<<3)

#define LED_MASK        (LED01 | LED02 | LED03 | LED04)

/*
 *  LEDとスイッチの状態マクロ
 */
#define ON              1     /* LEDやスイッチON状態             */
#define OFF             0     /* LEDやスイッチOFF状態            */

/*
 *  DIPSW設定
 */
#define DSW1             0x01
#define DSW2             0x02
#define DSW3             0x04
#define DSW4             0x08

/*
 *  LED接続ポート初期化
 */ 
extern void led_init(intptr_t exinf);

/*
 *  LED接続ポート読み出し
 */
uint_t led_in(void);

/*
 *  LED接続ポート書き込み
 */ 
void led_out(unsigned int led_data);

/*
 *  LEDとスイッチの個別設定・読み込み関数群
 */
extern void set_led_state(unsigned int led, unsigned char state);

#define NUM_EXTI15_FUNC  6
#define EXTI15_BASENO    10
#define INHNO_EXTI15 IRQ_VECTOR_EXTI15_10	/* 割込みハンドラ番号 */
#define INTNO_EXTI15 IRQ_VECTOR_EXTI15_10	/* 割込み番号 */
#define INTPRI_EXTI15    -4			/* 割込み優先度 */
#define INTATR_EXTI15    0			/* 割込み属性 */

#if defined(TOPPERS_STM32F769_DISCOVERY) || defined(TOPPERS_STM32F723_DISCOVERY)
#define INHNO_SW1   IRQ_VECTOR_EXTI0	/* 割込みハンドラ番号 */
#define INTNO_SW1   IRQ_VECTOR_EXTI0	/* 割込み番号 */
#define INTPRI_SW1  -4          /* 割込み優先度 */
#define INTATR_SW1  TA_EDGE     /* 割込み属性 */
#define NUM_EXTI_FUNC  1
#define EXTI_BASENO    0
#define exti_handler     exti0_handler
#define exti_func        exti0_func
#else
#define NUM_EXTI_FUNC  6
#define EXTI_BASENO    10
#define exti_func        exti15_func
#endif

extern void (*exti0_func[1])(void);
extern void (*exti15_func[NUM_EXTI15_FUNC])(void);

/*
 *  PSW接続ビット
 */
#define PSW1             0x00000001
#define PSW_MASK         (PSW1)
#define PSW_CHK_INTERVAL 10


/*
 *  PUSHスイッチ接続ポート初期化
 */
extern void switch_push_init(intptr_t exinf);

/*
 *  PUSHスイッチコールバック関数設定
 */
extern void setup_sw_func(intptr_t exinf);

/*
 *  EXTI割込みハンドラ
 */
extern void exti0_handler(void);
extern void exti15_handler(void);

/*
 *  DIPSWの取出し
 */
uint_t switch_dip_sense(void);


extern void device_info_init(intptr_t exinf);

extern uint_t dipsw_value;

#ifdef __cplusplus
}
#endif

#endif

